import pandas as pd
#all_dataぶちこみ。[dayid,race_id,馬名,能力,アガサン,ave3,能力の分散、アガサンの分散、偏差値能力、偏差値上がり]

columns = ['dayid','race_id',
           '馬名1','馬名2','馬名3','馬名4','馬名5','馬名6','馬名7','馬名8','馬名9','馬名10','馬名11','馬名12','馬名13','馬名14','馬名15','馬名16','馬名17','馬名18',
           '能力1','能力2','能力3','能力4','能力5','能力6','能力7','能力8','能力9','能力10','能力11','能力12','能力13','能力14','能力15','能力16','能力17','能力18',
           '上3F1','上3F2','上3F3','上3F4','上3F5','上3F6','上3F7','上3F8','上3F9','上3F10','上3F11','上3F12','上3F13','上3F14','上3F15','上3F16','上3F17','上3F18',
           'ave3-1','ave3-2','ave3-3','ave3-4','ave3-5','ave3-6','ave3-7','ave3-8','ave3-9','ave3-10','ave3-11','ave3-12','ave3-13','ave3-14','ave3-15','ave3-16','ave3-17','ave3-18',
           '能力の分散',
           '上3F分散',
           '能力偏差値1','能力偏差値2','能力偏差値3','能力偏差値4','能力偏差値5','能力偏差値6','能力偏差値7','能力偏差値8','能力偏差値9','能力偏差値10','能力偏差値11','能力偏差値12','能力偏差値13','能力偏差値14','能力偏差値15','能力偏差値16','能力偏差値17','能力偏差値18',
           '上3F偏差値1','上3F偏差値2','上3F偏差値3','上3F偏差値4','上3F偏差値5','上3F偏差値6','上3F偏差値7','上3F偏差値8','上3F偏差値9','上3F偏差値10','上3F偏差値11','上3F偏差値12','上3F偏差値13','上3F偏差値14','上3F偏差値15','上3F偏差値16','上3F偏差値17','上3F偏差値18',
           '予想タイム1','予想タイム2','予想タイム3','予想タイム4','予想タイム5','予想タイム6','予想タイム7','予想タイム8','予想タイム9','予想タイム10','予想タイム11','予想タイム12','予想タイム13','予想タイム14','予想タイム15','予想タイム16','予想タイム17','予想タイム18',
           ]

df = pd.DataFrame(columns=columns)#130行
df = df.fillna(0)
df.to_csv('C:/k-ba/keiba_nouryoku.csv',
          index=False)
df.to_csv('C:/k-ba/keiba_nouryoku_excel.csv',
          encoding='utf_8_sig',
          index=False)
